tutorials/incompressibleFluid/pitzDailyLESDevelopedInlet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type                mappedInternalValue;
        interpolationScheme cell;
        average             (10 0 0);
        value               uniform (10 0 0);
    }

    outlet
    {
        type                inletOutlet;
        inletValue          uniform (0 0 0);
        value               uniform (0 0 0);
    }

    upperWall
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }

    lowerWall
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }

    frontAndBack
    {
        type                empty;
    }
}

// ************************************************************************* //
